module.exports = [
  {
    secret: 'ツヴァルケ＆メルダ (早期加入)',
    requirements: [
      '08話 メルダが1機以上撃墜する',
      '28話 山本がメルダを撃墜する'
    ]
  },
  {
    secret: 'ブラックマイトガイン',
    requirements: [
      '17話 舞人、 トライボンバー、 ガードダイバーの合計撃墜数60以上でクリア'
    ]
  },
  {
    secret: 'ガランシェール＆ジンネマン',
    meta: {
      points: 0
    },
    requirements: [
      ['37話(宇宙) 4ポイント以上でバンシィ・ノルン(デストロイ)を撃墜する', '39話(地上、西暦) 6ポイント以上でクリア'],
    ],
    points: [
      '23話 バナージがマリーダと戦闘する (+1)',
      '23話 ジュドーがマリーダと戦闘する (+1)',
      '23話 バナージがマリーダを撃墜する (+1)',
      '25話 プルかプルツーがマリーダと戦闘する (+3)',
      '25話 ジュドーがマリーダと戦闘する (+1)',
      '25話 バナージがマリーダを撃墜する (+1)',
      '31話(宇宙世紀) プルかプルツーが？？？(バンシィ)と戦闘する (+2)',
      '32話(宇宙世紀) バナージがプルトゥエルブを説得する (+1)',
      '32話(宇宙世紀) ジュドー、 プル、 プルツーのいずれかがプルトゥエルブを説得する (+2)',
      '36話 バナージがリディと戦闘する (+1)',
      '36話 マリーダがリディと戦闘する (+1)',
      '36話 バナージがリディを撃墜する (+1)',
      '36話 マリーダがリディを撃墜する (+2)'
    ]
  },
  {
    secret: 'バイアラン・カスタム＆ジェリド、 ハンブラビ＆ヤザン',
    meta: {
      'onlyNormalRoute': true,
      points: 0
    },
    requirements: [
      ['37話(宇宙) 2ポイント以上でカミーユがジェリドを撃墜する', '39話 3ポイント以上でクリア'],
    ],
    points: [
      '25話(ロンド・ベル) ジュドー、 アムロ、 ハサウェイ、 バナージのいずれかがヤザンを撃墜する (+1)',
      '25話(ロンド・ベル) ジュドー、 アムロ、 ハサウェイ、 バナージのいずれかがジェリドを撃墜する (+1)',
      '23話(独自) ヤザンが1機以上撃墜する (+1)',
      '23話(独自) ジェリドが1機以上撃墜する (+1)',
      '23話(独自) ヤザン、 ジェリドがともに1機以上撃墜する (+1)',
      '24話(独自) カミーユ、 ジュドー、 アムロ、 ハサウェイ、 バナージのいずれかがヤザンを撃墜する (+1)',
      '24話(独自) カミーユ、 ジュドー、 アムロ、 ハサウェイ、 バナージのいずれかがジェリドを撃墜する (+1)',
      '30話(宇宙世紀) ヤザン、 ジェリドがともに1機以上撃墜する (+1)',
      '36話 カミーユがジェリドを撃墜する (+1)',
      '37話(宇宙) カミーユかジュドーがヤザンを撃墜する (+1)',
      '37話(宇宙) カミーユがジェリドを撃墜する (+1)'
    ]
  },
  {
    secret: 'ボン太くん (早期加入、 追加武装)',
    requirements: [
      '27話 宗介の撃墜数が40以上及び 宗介、 マオ、 クルツ、 クルーゾー、 テッサの合計撃墜数が100以上でクリア'
    ]
  },
  {
    secret: 'ペーネロペー＆レーン',
    meta: {
      'onlyNormalRoute': true,
      points: 0
    },
    requirements: [
      '39話 2ポイント以上でクリア',
    ],
    points: [
      '24話(独自) Ξガンダムが出撃状態で味方増援を出す (+1)',
      '24話(独自) ハサウェイがレーンと戦闘する (+1)',
      '30話(宇宙世紀) レーン(敵)を撃墜する (+1)',
      '30話(宇宙世紀) レーン(味方)が撃墜されない (+1)',
      '31話(宇宙世紀) ハサウェイがレーンと戦闘し両者生存する (+1)',
      '37話(宇宙) ハサウェイがレーンを撃墜する (+1)'
    ]
  },
  {
    secret: '胡蝶 (シナリオ変更)',
    requirements: [
      '28話(西暦世界) アキトが出撃状態でマイトカイザーが登場する'
    ]
  },
  {
    secret: '超合金Z (強化パーツ)',
    requirements: [
      '29話(宇宙世紀) ボスがくろがね屋で行動終了する'
    ]
  },
  {
    secret: 'Ξガンダム (追加武装)',
    'meta': {
      'onlyFirstLap': true,
      'onlyNormalRoute': true
    },
    requirements: [
      '31話(宇宙世紀) ハサウェイがレーンと戦闘し両者生存する'
    ]
  },
  {
    secret: 'サベージ(クロスボウ)',
    requirements: [
      '31話(宇宙世紀) サベージ(クロスボウ)で1機以上撃墜する'
    ]
  },
  {
    secret: 'α・アジール',
    requirements: [
      '31話(宇宙世紀) バナージとハサウェイがそれぞれ暴走したロニと戦闘する',
      '38話(宇宙) バナージかハサウェイがロニを説得する'
    ]
  },
  {
    secret: 'フルアーマーZZガンダム',
    meta: {
      'onlyNormalRoute': true
    },
    requirements: [
      '35話 ガランシェール加入ポイントが3以上、ジュドーがエースパイロット、ZZがカスタムボーナス取得済みでクリア'
    ]
  },
  {
    secret: 'レイジア＆ジル',
    meta: {
      'onlyFirstLap': true
    },
    requirements: [
      ['35話 アンジュ、 ヒルダ、 ロザリー、 ヴィヴィアンのいずれかがサリア、 エルシャ、 クリスと戦闘する', '37話(西暦世界) アンジュがサリア、エルシャ、クリスと戦闘する。ヒルダかロザリーがクリスと戦闘する'],
      '38話(西暦世界) ジルがサリアを撃墜する'
    ]
  },
  {
    secret: 'ナデシコC (追加武装)',
    meta: {
      'onlyFirstLap': true
    },
    requirements: [
      '36話 ルリがエースパイロットの状態でクリア'
    ]
  },
  {
    secret: 'ネオ・ジオング＆フロンタル',
    meta: {
      'onlyFirstLap': true,
      'onlyNormalRoute': true
    },
    requirements: [
      ['36話 カミーユ、アムロ、バナージがそれぞれフロンタルと戦闘する', '38話(宇宙) カミーユ、ジュドー、アムロ、ハサウェイ、バナージがそれぞれフロンタルと戦闘する']
    ]
  },
  {
    secret:'エヴァンゲリオン第13号機＆カヲル',
    requirements: [
      ['39話 シンジが第9の使徒か第10の使徒を撃墜し、エースパイロットの状態でクリア', '39話 シンジが第9、第10の使徒を撃墜する']
    ]
  },
  {
    secret:'長き旅路を支えるもの (シークレットシナリオ)',
    requirements: [
      '08話 メルダが1機以上撃墜する',
      ['28話 山本がメルダを撃墜する', '42話 沖田がエースパイロットの状態でクリア']
    ]
  },
  {
    secret:'ラファエルガンダム (残留)',
    requirements: [
      '43話(ヤマト) クリア後選択肢'
    ]
  },
  {
    secret:'ヴァングレイII＆サブ主人公',
    requirements: [
      '48話 主人公がサブ主人公を撃墜する'
    ]
  },
  {
    secret:'ルート分岐',
    requirements: [
      '47話 ヤマトが波動砲を使用する',
      '49話 50話開始時点でエースパイロット25人、グレートエース1人以上'
    ]
  }
];
